{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Resizing", "config": {"name": "resizing", "trainable": false, "dtype": "float32", "height": 200, "width": 200, "interpolation": "bilinear"}, "name": "resizing", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.image.rgb_to_grayscale", "trainable": false, "dtype": "float32", "function": "image.rgb_to_grayscale"}, "name": "tf.image.rgb_to_grayscale", "inbound_nodes": [["resizing", 0, 0, {}]]}, {"class_name": "Conv2D", "config": {"name": "gaussian_blur", "trainable": false, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "gaussian_blur", "inbound_nodes": [[["tf.image.rgb_to_grayscale", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "sobel_x", "trainable": false, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "sobel_x", "inbound_nodes": [[["gaussian_blur", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "sobel_y", "trainable": false, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "sobel_y", "inbound_nodes": [[["gaussian_blur", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.square", "trainable": false, "dtype": "float32", "function": "math.square"}, "name": "tf.math.square", "inbound_nodes": [["sobel_x", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.square_1", "trainable": false, "dtype": "float32", "function": "math.square"}, "name": "tf.math.square_1", "inbound_nodes": [["sobel_y", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add", "inbound_nodes": [["tf.math.square", 0, 0, {"y": ["tf.math.square_1", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.atan2", "trainable": false, "dtype": "float32", "function": "math.atan2"}, "name": "tf.math.atan2", "inbound_nodes": [["sobel_y", 0, 0, {"x": ["sobel_x", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.sqrt", "trainable": false, "dtype": "float32", "function": "math.sqrt"}, "name": "tf.math.sqrt", "inbound_nodes": [["tf.__operators__.add", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_1", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_1", "inbound_nodes": [["tf.math.atan2", 0, 0, {"y": 180, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max", "trainable": false, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max", "inbound_nodes": [["tf.math.sqrt", 0, 0, {"axis": 2}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.truediv_1", "trainable": false, "dtype": "float32", "function": "math.truediv"}, "name": "tf.math.truediv_1", "inbound_nodes": [["tf.math.multiply_1", 0, 0, {"y": 3.141592653589793, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max_1", "trainable": false, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max_1", "inbound_nodes": [["tf.math.reduce_max", 0, 0, {"axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.floormod", "trainable": false, "dtype": "float32", "function": "math.floormod"}, "name": "tf.math.floormod", "inbound_nodes": [["tf.math.truediv_1", 0, 0, {"y": 180, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.reshape", "trainable": false, "dtype": "float32", "function": "reshape"}, "name": "tf.reshape", "inbound_nodes": [["tf.math.reduce_max_1", 0, 0, {"shape": [-1, 1, 1, 1]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_equal", "trainable": false, "dtype": "float32", "function": "math.greater_equal"}, "name": "tf.math.greater_equal", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 157.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.less", "trainable": false, "dtype": "float32", "function": "math.less"}, "name": "tf.math.less", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 22.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_equal_2", "trainable": false, "dtype": "float32", "function": "math.greater_equal"}, "name": "tf.math.greater_equal_2", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 67.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.less_2", "trainable": false, "dtype": "float32", "function": "math.less"}, "name": "tf.math.less_2", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 112.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.truediv", "trainable": false, "dtype": "float32", "function": "math.truediv"}, "name": "tf.math.truediv", "inbound_nodes": [["tf.math.sqrt", 0, 0, {"y": ["tf.reshape", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast", "inbound_nodes": [["tf.math.greater_equal", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_1", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_1", "inbound_nodes": [["tf.math.less", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_4", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_4", "inbound_nodes": [["tf.math.greater_equal_2", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_5", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_5", "inbound_nodes": [["tf.math.less_2", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_equal_1", "trainable": false, "dtype": "float32", "function": "math.greater_equal"}, "name": "tf.math.greater_equal_1", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 22.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.less_1", "trainable": false, "dtype": "float32", "function": "math.less"}, "name": "tf.math.less_1", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 67.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply", "inbound_nodes": [["tf.math.truediv", 0, 0, {"y": 1.0, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_1", "inbound_nodes": [["tf.cast", 0, 0, {"y": ["tf.cast_1", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_3", "inbound_nodes": [["tf.cast_4", 0, 0, {"y": ["tf.cast_5", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_2", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_2", "inbound_nodes": [["tf.math.greater_equal_1", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_3", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_3", "inbound_nodes": [["tf.math.less_1", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_equal_3", "trainable": false, "dtype": "float32", "function": "math.greater_equal"}, "name": "tf.math.greater_equal_3", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 112.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.less_3", "trainable": false, "dtype": "float32", "function": "math.less"}, "name": "tf.math.less_3", "inbound_nodes": [["tf.math.floormod", 0, 0, {"y": 157.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_2", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_2", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": ["tf.__operators__.add_1", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "target_pixels_0", "trainable": false, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "target_pixels_0", "inbound_nodes": [[["tf.math.multiply", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_4", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_4", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": ["tf.__operators__.add_3", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "target_pixels_90", "trainable": false, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "target_pixels_90", "inbound_nodes": [[["tf.math.multiply", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_2", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_2", "inbound_nodes": [["tf.cast_2", 0, 0, {"y": ["tf.cast_3", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_6", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_6", "inbound_nodes": [["tf.math.greater_equal_3", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_7", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_7", "inbound_nodes": [["tf.math.less_3", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater", "trainable": false, "dtype": "float32", "function": "math.greater"}, "name": "tf.math.greater", "inbound_nodes": [["tf.math.multiply_2", 0, 0, {"y": ["target_pixels_0", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_1", "trainable": false, "dtype": "float32", "function": "math.greater"}, "name": "tf.math.greater_1", "inbound_nodes": [["tf.math.multiply_4", 0, 0, {"y": ["target_pixels_90", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_6", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_6", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": ["tf.__operators__.add_2", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "target_pixels_45", "trainable": false, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "target_pixels_45", "inbound_nodes": [[["tf.math.multiply", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_4", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_4", "inbound_nodes": [["tf.cast_6", 0, 0, {"y": ["tf.cast_7", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_8", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_8", "inbound_nodes": [["tf.math.greater", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_9", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_9", "inbound_nodes": [["tf.math.greater_1", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_2", "trainable": false, "dtype": "float32", "function": "math.greater"}, "name": "tf.math.greater_2", "inbound_nodes": [["tf.math.multiply_6", 0, 0, {"y": ["target_pixels_45", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_8", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_8", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": ["tf.__operators__.add_4", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "target_pixels_135", "trainable": false, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "target_pixels_135", "inbound_nodes": [[["tf.math.multiply", 0, 0, {}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["tf.cast_8", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 0, "stop": 1, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_1", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_1", "inbound_nodes": [["tf.cast_8", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 1, "stop": 2, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_2", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_2", "inbound_nodes": [["tf.cast_9", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 0, "stop": 1, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_3", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_3", "inbound_nodes": [["tf.cast_9", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 1, "stop": 2, "step": null}]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_10", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_10", "inbound_nodes": [["tf.math.greater_2", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_3", "trainable": false, "dtype": "float32", "function": "math.greater"}, "name": "tf.math.greater_3", "inbound_nodes": [["tf.math.multiply_8", 0, 0, {"y": ["target_pixels_135", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_3", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_3", "inbound_nodes": [["tf.__operators__.getitem", 0, 0, {"y": ["tf.__operators__.getitem_1", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_5", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_5", "inbound_nodes": [["tf.__operators__.getitem_2", 0, 0, {"y": ["tf.__operators__.getitem_3", 0, 0], "name": null}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_4", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_4", "inbound_nodes": [["tf.cast_10", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 0, "stop": 1, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_5", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_5", "inbound_nodes": [["tf.cast_10", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 1, "stop": 2, "step": null}]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_11", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_11", "inbound_nodes": [["tf.math.greater_3", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_5", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_5", "inbound_nodes": [["tf.math.multiply_3", 0, 0, {"y": ["tf.math.multiply_5", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_7", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_7", "inbound_nodes": [["tf.__operators__.getitem_4", 0, 0, {"y": ["tf.__operators__.getitem_5", 0, 0], "name": null}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_6", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_6", "inbound_nodes": [["tf.cast_11", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 0, "stop": 1, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_7", "trainable": false, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_7", "inbound_nodes": [["tf.cast_11", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": 1, "stop": 2, "step": null}]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_6", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_6", "inbound_nodes": [["tf.__operators__.add_5", 0, 0, {"y": ["tf.math.multiply_7", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_9", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_9", "inbound_nodes": [["tf.__operators__.getitem_6", 0, 0, {"y": ["tf.__operators__.getitem_7", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_7", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_7", "inbound_nodes": [["tf.__operators__.add_6", 0, 0, {"y": ["tf.math.multiply_9", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_10", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_10", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": ["tf.__operators__.add_7", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value", "inbound_nodes": [["tf.math.multiply_10", 0, 0, {"clip_value_min": 0.0, "clip_value_max": 1.0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_equal_4", "trainable": false, "dtype": "float32", "function": "math.greater_equal"}, "name": "tf.math.greater_equal_4", "inbound_nodes": [["tf.clip_by_value", 0, 0, {"y": 0.2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.less_4", "trainable": false, "dtype": "float32", "function": "math.less"}, "name": "tf.math.less_4", "inbound_nodes": [["tf.clip_by_value", 0, 0, {"y": 0.2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.greater_equal_5", "trainable": false, "dtype": "float32", "function": "math.greater_equal"}, "name": "tf.math.greater_equal_5", "inbound_nodes": [["tf.clip_by_value", 0, 0, {"y": 0.1, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_12", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_12", "inbound_nodes": [["tf.math.greater_equal_4", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_13", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_13", "inbound_nodes": [["tf.math.less_4", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_14", "trainable": false, "dtype": "float32", "function": "cast"}, "name": "tf.cast_14", "inbound_nodes": [["tf.math.greater_equal_5", 0, 0, {"dtype": "float32"}]]}, {"class_name": "Conv2D", "config": {"name": "edges_connected", "trainable": false, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "edges_connected", "inbound_nodes": [[["tf.cast_12", 0, 0, {}]], [["tf.math.multiply_12", 0, 0, {}]], [["tf.math.multiply_13", 0, 0, {}]], [["tf.math.multiply_14", 0, 0, {}]], [["tf.math.multiply_15", 0, 0, {}]], [["tf.math.multiply_16", 0, 0, {}]], [["tf.math.multiply_17", 0, 0, {}]], [["tf.math.multiply_18", 0, 0, {}]], [["tf.math.multiply_19", 0, 0, {}]], [["tf.math.multiply_20", 0, 0, {}]], [["tf.math.multiply_21", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_11", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_11", "inbound_nodes": [["tf.cast_13", 0, 0, {"y": ["tf.cast_14", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_12", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_12", "inbound_nodes": [["edges_connected", 0, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_13", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_13", "inbound_nodes": [["edges_connected", 1, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_14", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_14", "inbound_nodes": [["edges_connected", 2, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_15", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_15", "inbound_nodes": [["edges_connected", 3, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_16", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_16", "inbound_nodes": [["edges_connected", 4, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_17", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_17", "inbound_nodes": [["edges_connected", 5, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_18", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_18", "inbound_nodes": [["edges_connected", 6, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_19", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_19", "inbound_nodes": [["edges_connected", 7, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_20", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_20", "inbound_nodes": [["edges_connected", 8, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_21", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_21", "inbound_nodes": [["edges_connected", 9, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_22", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_22", "inbound_nodes": [["edges_connected", 10, 0, {"y": ["tf.math.multiply_11", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_1", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_1", "inbound_nodes": [["tf.math.multiply_22", 0, 0, {"clip_value_min": 0.0, "clip_value_max": 1.0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_8", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_8", "inbound_nodes": [["tf.cast_12", 0, 0, {"y": ["tf.clip_by_value_1", 0, 0], "name": null}]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["tf.__operators__.add_8", 0, 0]]}}, "training_config": {"loss": null, "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.001, "decay": 0.0, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "edges_connected/kernel", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "gaussian_blur/kernel", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "sobel_x/kernel", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "sobel_y/kernel", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "target_pixels_0/kernel", "shape": [3, 3, 1, 2], "dtype": "float32"}, {"name": "target_pixels_135/kernel", "shape": [3, 3, 1, 2], "dtype": "float32"}, {"name": "target_pixels_45/kernel", "shape": [3, 3, 1, 2], "dtype": "float32"}, {"name": "target_pixels_90/kernel", "shape": [3, 3, 1, 2], "dtype": "float32"}]}]}